###################################################################

# Created by write_sdc on Fri Feb 21 16:21:17 2020

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[31]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[30]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[29]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[28]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[27]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[26]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[25]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[24]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[23]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[22]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[21]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[20]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[19]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[18]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[17]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[16]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[15]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[14]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[13]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[12]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[11]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[10]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[9]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[8]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[7]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[6]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[5]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[4]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[3]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[2]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[1]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDR[0]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[31]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[30]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[29]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[28]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[27]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[26]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[25]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[24]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[23]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[22]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[21]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[20]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[19]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[18]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[17]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[16]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[15]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[14]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[13]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[12]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[11]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[10]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[9]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[8]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[7]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[6]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[5]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[4]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[3]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[2]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[1]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDR[0]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[31]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[30]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[29]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[28]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[27]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[26]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[25]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[24]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[23]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[22]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[21]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[20]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[19]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[18]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[17]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[16]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[15]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[14]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[13]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[12]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[11]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[10]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[9]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[8]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[7]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[6]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[5]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[4]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[3]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[2]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[1]}]
set_load -pin_load 3.40189 [get_ports {DRAM_IN[0]}]
set_load -pin_load 3.40189 [get_ports {DRAM_WR_EN[1]}]
set_load -pin_load 3.40189 [get_ports {DRAM_WR_EN[0]}]
create_clock [get_ports CLK]  -period 2  -waveform {0 1}
set_clock_uncertainty 0.07  [get_clocks CLK]
set_max_delay 2  -from [list [get_ports {IRAM_OUT[31]}] [get_ports {IRAM_OUT[30]}] [get_ports  \
{IRAM_OUT[29]}] [get_ports {IRAM_OUT[28]}] [get_ports {IRAM_OUT[27]}]          \
[get_ports {IRAM_OUT[26]}] [get_ports {IRAM_OUT[25]}] [get_ports               \
{IRAM_OUT[24]}] [get_ports {IRAM_OUT[23]}] [get_ports {IRAM_OUT[22]}]          \
[get_ports {IRAM_OUT[21]}] [get_ports {IRAM_OUT[20]}] [get_ports               \
{IRAM_OUT[19]}] [get_ports {IRAM_OUT[18]}] [get_ports {IRAM_OUT[17]}]          \
[get_ports {IRAM_OUT[16]}] [get_ports {IRAM_OUT[15]}] [get_ports               \
{IRAM_OUT[14]}] [get_ports {IRAM_OUT[13]}] [get_ports {IRAM_OUT[12]}]          \
[get_ports {IRAM_OUT[11]}] [get_ports {IRAM_OUT[10]}] [get_ports               \
{IRAM_OUT[9]}] [get_ports {IRAM_OUT[8]}] [get_ports {IRAM_OUT[7]}] [get_ports  \
{IRAM_OUT[6]}] [get_ports {IRAM_OUT[5]}] [get_ports {IRAM_OUT[4]}] [get_ports  \
{IRAM_OUT[3]}] [get_ports {IRAM_OUT[2]}] [get_ports {IRAM_OUT[1]}] [get_ports  \
{IRAM_OUT[0]}] [get_ports {DRAM_OUT[31]}] [get_ports {DRAM_OUT[30]}]           \
[get_ports {DRAM_OUT[29]}] [get_ports {DRAM_OUT[28]}] [get_ports               \
{DRAM_OUT[27]}] [get_ports {DRAM_OUT[26]}] [get_ports {DRAM_OUT[25]}]          \
[get_ports {DRAM_OUT[24]}] [get_ports {DRAM_OUT[23]}] [get_ports               \
{DRAM_OUT[22]}] [get_ports {DRAM_OUT[21]}] [get_ports {DRAM_OUT[20]}]          \
[get_ports {DRAM_OUT[19]}] [get_ports {DRAM_OUT[18]}] [get_ports               \
{DRAM_OUT[17]}] [get_ports {DRAM_OUT[16]}] [get_ports {DRAM_OUT[15]}]          \
[get_ports {DRAM_OUT[14]}] [get_ports {DRAM_OUT[13]}] [get_ports               \
{DRAM_OUT[12]}] [get_ports {DRAM_OUT[11]}] [get_ports {DRAM_OUT[10]}]          \
[get_ports {DRAM_OUT[9]}] [get_ports {DRAM_OUT[8]}] [get_ports {DRAM_OUT[7]}]  \
[get_ports {DRAM_OUT[6]}] [get_ports {DRAM_OUT[5]}] [get_ports {DRAM_OUT[4]}]  \
[get_ports {DRAM_OUT[3]}] [get_ports {DRAM_OUT[2]}] [get_ports {DRAM_OUT[1]}]  \
[get_ports {DRAM_OUT[0]}] [get_ports CLK] [get_ports RST]]  -to [list [get_ports {IRAM_ADDR[31]}] [get_ports {IRAM_ADDR[30]}] [get_ports  \
{IRAM_ADDR[29]}] [get_ports {IRAM_ADDR[28]}] [get_ports {IRAM_ADDR[27]}]       \
[get_ports {IRAM_ADDR[26]}] [get_ports {IRAM_ADDR[25]}] [get_ports             \
{IRAM_ADDR[24]}] [get_ports {IRAM_ADDR[23]}] [get_ports {IRAM_ADDR[22]}]       \
[get_ports {IRAM_ADDR[21]}] [get_ports {IRAM_ADDR[20]}] [get_ports             \
{IRAM_ADDR[19]}] [get_ports {IRAM_ADDR[18]}] [get_ports {IRAM_ADDR[17]}]       \
[get_ports {IRAM_ADDR[16]}] [get_ports {IRAM_ADDR[15]}] [get_ports             \
{IRAM_ADDR[14]}] [get_ports {IRAM_ADDR[13]}] [get_ports {IRAM_ADDR[12]}]       \
[get_ports {IRAM_ADDR[11]}] [get_ports {IRAM_ADDR[10]}] [get_ports             \
{IRAM_ADDR[9]}] [get_ports {IRAM_ADDR[8]}] [get_ports {IRAM_ADDR[7]}]          \
[get_ports {IRAM_ADDR[6]}] [get_ports {IRAM_ADDR[5]}] [get_ports               \
{IRAM_ADDR[4]}] [get_ports {IRAM_ADDR[3]}] [get_ports {IRAM_ADDR[2]}]          \
[get_ports {IRAM_ADDR[1]}] [get_ports {IRAM_ADDR[0]}] [get_ports               \
{DRAM_ADDR[31]}] [get_ports {DRAM_ADDR[30]}] [get_ports {DRAM_ADDR[29]}]       \
[get_ports {DRAM_ADDR[28]}] [get_ports {DRAM_ADDR[27]}] [get_ports             \
{DRAM_ADDR[26]}] [get_ports {DRAM_ADDR[25]}] [get_ports {DRAM_ADDR[24]}]       \
[get_ports {DRAM_ADDR[23]}] [get_ports {DRAM_ADDR[22]}] [get_ports             \
{DRAM_ADDR[21]}] [get_ports {DRAM_ADDR[20]}] [get_ports {DRAM_ADDR[19]}]       \
[get_ports {DRAM_ADDR[18]}] [get_ports {DRAM_ADDR[17]}] [get_ports             \
{DRAM_ADDR[16]}] [get_ports {DRAM_ADDR[15]}] [get_ports {DRAM_ADDR[14]}]       \
[get_ports {DRAM_ADDR[13]}] [get_ports {DRAM_ADDR[12]}] [get_ports             \
{DRAM_ADDR[11]}] [get_ports {DRAM_ADDR[10]}] [get_ports {DRAM_ADDR[9]}]        \
[get_ports {DRAM_ADDR[8]}] [get_ports {DRAM_ADDR[7]}] [get_ports               \
{DRAM_ADDR[6]}] [get_ports {DRAM_ADDR[5]}] [get_ports {DRAM_ADDR[4]}]          \
[get_ports {DRAM_ADDR[3]}] [get_ports {DRAM_ADDR[2]}] [get_ports               \
{DRAM_ADDR[1]}] [get_ports {DRAM_ADDR[0]}] [get_ports {DRAM_IN[31]}]           \
[get_ports {DRAM_IN[30]}] [get_ports {DRAM_IN[29]}] [get_ports {DRAM_IN[28]}]  \
[get_ports {DRAM_IN[27]}] [get_ports {DRAM_IN[26]}] [get_ports {DRAM_IN[25]}]  \
[get_ports {DRAM_IN[24]}] [get_ports {DRAM_IN[23]}] [get_ports {DRAM_IN[22]}]  \
[get_ports {DRAM_IN[21]}] [get_ports {DRAM_IN[20]}] [get_ports {DRAM_IN[19]}]  \
[get_ports {DRAM_IN[18]}] [get_ports {DRAM_IN[17]}] [get_ports {DRAM_IN[16]}]  \
[get_ports {DRAM_IN[15]}] [get_ports {DRAM_IN[14]}] [get_ports {DRAM_IN[13]}]  \
[get_ports {DRAM_IN[12]}] [get_ports {DRAM_IN[11]}] [get_ports {DRAM_IN[10]}]  \
[get_ports {DRAM_IN[9]}] [get_ports {DRAM_IN[8]}] [get_ports {DRAM_IN[7]}]     \
[get_ports {DRAM_IN[6]}] [get_ports {DRAM_IN[5]}] [get_ports {DRAM_IN[4]}]     \
[get_ports {DRAM_IN[3]}] [get_ports {DRAM_IN[2]}] [get_ports {DRAM_IN[1]}]     \
[get_ports {DRAM_IN[0]}] [get_ports {DRAM_WR_EN[1]}] [get_ports                \
{DRAM_WR_EN[0]}]]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[31]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[30]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[29]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[28]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[27]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[26]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[25]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[24]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[23]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[22]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[21]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[20]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[19]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[18]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[17]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[16]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[15]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[14]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[13]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[12]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[11]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[10]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[9]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[8]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[7]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[6]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[5]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[4]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[3]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[2]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[1]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {IRAM_OUT[0]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[31]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[30]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[29]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[28]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[27]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[26]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[25]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[24]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[23]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[22]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[21]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[20]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[19]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[18]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[17]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[16]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[15]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[14]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[13]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[12]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[11]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[10]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[9]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[8]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[7]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[6]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[5]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[4]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[3]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[2]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[1]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {DRAM_OUT[0]}]
set_input_delay -clock CLK  -max 0.5  [get_ports RST]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[31]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[30]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[29]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[28]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[27]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[26]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[25]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[24]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[23]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[22]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[21]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[20]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[19]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[18]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[17]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[16]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[15]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[14]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[13]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[12]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[11]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[10]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[9]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[8]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[7]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[6]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[5]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[4]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[3]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[2]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[1]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {IRAM_ADDR[0]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[31]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[30]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[29]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[28]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[27]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[26]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[25]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[24]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[23]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[22]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[21]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[20]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[19]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[18]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[17]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[16]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[15]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[14]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[13]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[12]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[11]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[10]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[9]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[8]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[7]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[6]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[5]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[4]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[3]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[2]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[1]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_ADDR[0]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[31]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[30]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[29]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[28]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[27]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[26]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[25]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[24]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[23]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[22]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[21]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[20]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[19]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[18]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[17]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[16]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[15]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[14]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[13]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[12]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[11]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[10]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[9]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[8]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[7]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[6]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[5]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[4]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[3]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[2]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[1]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_IN[0]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_WR_EN[1]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {DRAM_WR_EN[0]}]
